# -*- coding: utf-8 -*-
"""
Created on Mon Nov 28 16:14:13 2022

@author: KITCOOP
20221129.py
"""
'''
  함수 : def 예약어로 함수 정의
         return 값 : 함수를 종료하고 값을 전달
         매개변수 : 함수를 호출할때 필요한 인자값 정의
              가변매개변수 : 매개변수의 갯수를 지정안함. 0개이상. * p 표현
              기본값설정 : (n1=0,n2=0) : 0,1,2개의 매개변수 가능 
  예외처리 : try, except, finally, else, raise
  클래스 : 멤버변수,멤버함수, 생성자.
           인스턴스변수 : self.변수명. 객체별로 할당되는 변수
           클래스변수   : 클래스명.변수명. 모든객체의 공통변수
    self : 자기참조변수. 인스턴스함수에 첫번째 매개변수로 설정.
   생성자 : __init__(self,...) : 객체생성에 관여하는 함수
           클래스내부에 생성자가 없으면 기본생성자를 제공.        
   상속 : class 클래스명 (부모클래스명1,부모클래스명2,..) :
          다중상속가능           
          오버라이딩 : 부모클래스의 함수를 자손클래스가 재정의
'''

