# -*- coding: utf-8 -*-
"""
Created on Mon Dec 12 13:51:25 2022

@author: KITCOOP
test1212.py
"""

'''
1. http://www.kma.go.kr/weather/forecast/mid-term-rss3.jsp 의 내용을 
   인터넷을 통해 데이터를 수신하고 다음 결과형태로 출력하시오.
   결과는 현재 날씨에 따라 달라 질수 있습니다.
[결과]
+ 구름많고 눈
 |-  서울
 |-  인천
 |-  수원
 |-  파주
 |-  이천
 |-  평택
+ 구름많음
 |-  춘천
 |-  원주
 |-  청주
 |-  충주
 |-  영동
 |-  광주
 |-  목포
 |-  여수
 |-  순천
 |-  광양
 |-  나주
 |-  대구
 |-  안동
 |-  포항
 |-  경주
 |-  울진
 |-  울릉도
 |-  제주
 |-  서귀포
+ 맑음
 |-  강릉
 |-  부산
 |-  울산
 |-  창원
 |-  진주
 |-  거창
 |-  통영
+ 구름많고 비/눈
 |-  대전
 |-  세종
 |-  홍성
+ 흐리고 비/눈
 |-  전주
 |-  군산
 |-  정읍
 |-  남원
 |-  고창
 |-  무주
'''   


 
 
'''
2. 네이버 로그인 후 상품 목록 조회하기 
   네이버 로그인.
   쇼핑 메뉴 선택
   쇼핑MY 메뉴 선택
   주문확인/배송조회를 선택
'''
